app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."commenter" = ? LIMIT 1  [["commenter", "113"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
---
<%= puts "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" %>
<%= c = Comment.all %>
<%= puts c.first %>
<%= d = Comment.find_by(commenter: '12345') ; puts d.body %>
<%= e = Article.find_by(id: 4) ; puts e.title %>